controltheory/beamer/1/1_3_signal.org
# +LaTeX_CLASS: article
#+LATEX_HEADER: \usepackage{etex}
#+LATEX_HEADER: \usepackage{amsmath}
 # +LATEX_HEADER: \usepackage[usenames]{color}
#+LATEX_HEADER: \usepackage{pstricks}
#+LATEX_HEADER: \usepackage{pgfplots}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage[europeanresistors,americaninductors]{circuitikz}
#+LATEX_HEADER: \usepackage{colortbl}
#+LATEX_HEADER: \usepackage{yfonts}
#+LATEX_HEADER: \usetikzlibrary{shapes,arrows}
#+LATEX_HEADER: \usetikzlibrary{positioning}
#+LATEX_HEADER: \usetikzlibrary{arrows,shapes}
#+LATEX_HEADER: \usetikzlibrary{intersections}
#+LATEX_HEADER: \usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
#+LATEX_HEADER: \usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
#+LATEX_HEADER: \setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
#+LATEX_HEADER: \setCJKmonofont{Evermore Kai}
 # +LATEX_HEADER: \xeCJKsetup{CJKglue=\hspace{0pt plus .08 \baselineskip }}
#+LATEX_HEADER: \usepackage{pst-node}
#+LATEX_HEADER: \usepackage{pst-plot}
#+LATEX_HEADER: \psset{unit=5mm}

#+startup: beamer
#+LaTeX_CLASS: beamer
# +LaTeX_CLASS_OPTIONS: [bigger]
 # +latex_header: \usepackage{beamerarticle}
# +latex_header: \mode<beamer>{\usetheme{JuanLesPins}}
#+latex_header: \mode<beamer>{\usetheme{Frankfurt}}
#+latex_header: \mode<beamer>{\usecolortheme{dove}}
#+latex_header: \mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}

#+TITLE:  自动控制的基本概念
#+AUTHOR:    
#+EMAIL:
#+DATE:
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
#+latex_header: \AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}

#+latex_header:\setbeamercovered{transparent}
#+BEAMER_FRAME_LEVEL: 2
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)















* 概念与分类
** 基本概念
  * 信号: 随时间和空间变化的某种物理量.
     * 信号通常是时间变量 $t$ 的函数
     * 信号的特性可从两方面来描述
          * 时域特性
          * 频域特性
  * 系统: 能够对信号完成某种变换或运算功能的集合体称为系统
** 闭环系统组成

# +begin_example
#    
#    给定 ----> (+/-)----> 串联校正 ---->(+/-) 放大 ----> 执行 ----> 对象 -----> 输出
#                ^                       ^                  |           |
#                |                       |                  |           |
#                |                       '-------局部反馈 ----           |
#                |                                                     |
#                '-----------------------------  主反馈 ----------------'
# +end_example
\begin{tikzpicture}[node distance=2em,auto,>=latex', thick ]
\tikzstyle{every node}=[font=\small]
%\path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[text width =1em] (r) {给定}; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$ $,right =of r] (p1) { }; 
\path[->](r) edge node {} (p1) ; 
\path[blue] node[text width=1em,draw, right =of p1] (n) {串联校正}; 
\path[->] (p1) edge node[midway] {} (n) ; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$ $,right =of n] (p2) { }; 
\path[->](n) edge node {} (p2) ; 
\path[red] node[draw, inner sep=5pt,right =of p2] (a) {放大}; 
\path[->] (p2) edge node[midway] {} (a) ; 
\path[red] node[draw, inner sep=5pt,right =of a] (e) {执行}; 
\path[->] (a) edge node[midway] {} (e) ; 
\path[red] node[draw, text width=1em,inner sep=5pt,right =of e] (g) {被控对象}; 
\path[->] (e) edge node [midway]{$ $} (g); 
\path[->] node[ right =of g,text width=1em] (o) {输出}; 
\path[->] (g) edge node {} (o); 

\path[blue] node[draw, below =of a] (l) {局部反馈};
\path[->,draw] (e.east)+(1em,0) |- (l.east) ; 
\path[->,draw] (l.west) -| node[very near end] {$-$}(p2) ; 

\path[blue] node[draw, below =of l] (h) {主反馈};
\path[->,draw] (g.east)+(1em,0) |- (h.east) ; 
\path[->,draw] (h.west) -| node[very near end] {$-$}(p1) ; 
\end{tikzpicture} 

** 闭环系统中的信号
 * <2->输入信号：给定信号及干扰信号
 * <2->输出信号：被控量的物理量
 * <3->反馈信号：反馈元部件的输出
# * <4->偏差信号：给定信号与主反馈信号之差
 * <4->误差信号：输出量的希望值与实际值之差
 * <5->干扰信号：系统受到的内外干扰

** 典型信号
  *  <2->阶跃信号（函数）  $r(t)=\begin{cases} A & t\geq 0 \\ 0 & t < 0 \end{cases}$
  *  <3->脉冲信号（函数）  $r(t)=\begin{cases}\frac{A}{\epsilon}  & 0\leq t\leq \epsilon\\ 0 & others\end{cases}$
  *  <4->正弦信号（函数）  $r(t)=A\sin(\omega t), t>0$
  *  <5->斜坡信号（函数）  $r(t)=Vt  ,     t>0$
  *  <6->加速度信号（函数）$r(t)=\frac{1}{2}at^2,  t>0$

** 按给定量的运动规律分类
 1. <2->镇定系统：输入 $r(t)$ 不变
 1. <3->程序控制系统：输入 $r(t)$ 按规律变化
 1. <4->随动系统:输入 $r(t)$ 随机变化

** 按系统性能分类
 1. <2->线性系统和非线性系统
    * 线性系统: 系统的输入和输出因果关系可以用线性微分方程描述
    * 非线性系统: $r(t)$ 和 $c(t)$ 关系只能用非线性方程描述
 1. <3->定常系统与时变系统
    * 定常系统：微分方程中各项系数为常数 $a_0c''(t)+a_1c'(t)=r(t)$
    * 时变系统：各项系数中有随时间变化的量 $a_0(t)c''(t)+a_1(t)c'(t)=r(t)$
 1. <4->连续系统与离散系统
    * 连续系统：系统中信号是时间t的连续函数的模拟量
    * 离散系统：系统中存在脉冲量或数字信号
 1. <5->确定性和不确定性系统
    确定性系统：系统中微分方程参数变化是精确可知的
    不确定性系统：参数变化只是部分可知或近似可知

# *** 本课程研究对象
# 1. <2->线性连续定常系统：第2、3、4、5、6章
# 1. <3->线性离散定常系统：第7章
# 1. <4->典型非线性控制系统：第8章

* 控制系统基本要求
** 基本要求：稳定性、稳态性能、瞬态性能
 1. <2->稳定性: 正常工作的先决条件
 1. <3->稳态性能: 指标：稳态误差
 1. <4->瞬态性能:
    1. <5->峰值时间：$t_p$
    1. <6->调节时间：$t_s$
    1. <7->超调量：$\sigma \% = \frac{c(t_p)-c(\infty)}{c(\infty)}$

** 示例:响应曲线 
*** 初始值:0，期望值1：   				      :B_block:BMCOL:
     :PROPERTIES:
     :BEAMER_env: block
     :BEAMER_col: 0.7
     :END:

# +begin_example
#        c(t) ^
#             |
#             |
#      c(t_p) +              '.
#     1.05c_0-+. . . . . .  / .\ . . . . .,\ . . . . . . . . . . . . 
#      c_0   -+----------- /----+ -----  /--\----- /-+---/-+----------
#     0.95c_0 +. . . . . ./ . .  \ . . /-. . .\. /-. .\--. . . . . . 
#             |         /-        \  /-        \/
#             |        /           `'
#             |       /      
#             |              
#             |      /        
#             |     /         
#             |   /-         
#             |  /            
#             | /            
#             |/              
#        -----+--------------+---------------------------+------------>
#             |O             t_p                         t_s         t
#             |
# +end_example

\begin{tikzpicture}[scale=2]
\coordinate (o) at (0,0);
\coordinate (ox) at (3,0);
\coordinate (oy) at (0,1.5);
\draw[->] (o) -- (ox);
\draw[->] (o) -- (oy);
\draw (o) node[below] {$o$};
\draw [red,thick,smooth] plot coordinates {(0,0) (1,1) (1.5,1.2) (2,1.05) (2.5,0.95) (3,1)};
\draw[thick,blue,dashed] (0,1) -- (3,1);
\draw[thick,violet,dashed] (0,0.95) -- (3,0.95);
\draw[thick,violet,dashed] (0,1.05) -- (3,1.05);
\draw[thick,red,dashed] (1.5,1.2) -- (1.5,0);\draw (1.5,0) node[below] {$t_p$};
\draw[thick,red,dashed] (2,1.05) -- (2,0);\draw (2,0) node[below] {$t_s$};
\draw (o) node[left] {$0$}
;\draw (0,1) node[left] {$1$};
\end{tikzpicture}

*** 指标： 						      :BMCOL:B_block:
     :PROPERTIES:
     :BEAMER_col: 0.3
     :BEAMER_env: block
     :END:

 -  <2->超调量 $\sigma\%$
 -  <3->调节时间 $t_s$
 -  <4->上升时间 $t_r$ 
#     * $100\%$ 的 $t_r$ 
#     * $90\%$ 的 $t_r$ 
#     * $70\%$ 的 $t_r$
 -  <5->峰值时间 $t_p$ 
# -  <6->振荡次数

** 指标
 -  超调量：  $(c(t_p)-c(\infty))/c(\infty)$
 -  调节时间： 若有 $t_s$ ,当 $t\geq t_s$ 时有 $|c(t)-c(\infty)|\leq 0.05c(\infty)$ （或 $0.03c(\infty)$ ）成立，则 $t_s$ 为该系统调节时间。
 -  上升时间 $t_r$ ，定义
      * $100\%$ 的 $t_r，c(t)$ 首次达到 $c(\infty)$ 的时间
      * $90\%$ 的 $t_r，c(t)$ 首次达到 $90\%c(\infty)$ 的时间
      * $70\%$ 的 $t_r，c(t)$ 首次达到 $70\%c(\infty)$ 的时间
 -  峰值时间 $t_p$ ： $c(t_p)=Max(c(t))$
# -  振荡次数：在 $t<=t_s$ 期间， $c(t)$ 围绕 $c(\infty)$ 上下振荡的次数



