controltheory/beamer/1/1_3_signal.tex
% Created 2014-10-09 星期四 10:38
\documentclass{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{etex}
\usepackage{amsmath}
\usepackage{pstricks}
\usepackage{pgfplots}
\usepackage{tikz}
\usepackage[europeanresistors,americaninductors]{circuitikz}
\usepackage{colortbl}
\usepackage{yfonts}
\usetikzlibrary{shapes,arrows}
\usetikzlibrary{positioning}
\usetikzlibrary{arrows,shapes}
\usetikzlibrary{intersections}
\usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
\usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
\setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
\setCJKmonofont{Evermore Kai}
\usepackage{pst-node}
\usepackage{pst-plot}
\psset{unit=5mm}
\mode<beamer>{\usetheme{Frankfurt}}
\mode<beamer>{\usecolortheme{dove}}
\mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}
\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}
\setbeamercovered{transparent}
\providecommand{\alert}[1]{\textbf{#1}}

\title{自动控制的基本概念}
\author{}
\date{}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\begin{frame}
\frametitle{Outline}
\setcounter{tocdepth}{3}
\tableofcontents
\end{frame}


















\section{概念与分类}
\label{sec-1}
\begin{frame}
\frametitle{基本概念}
\label{sec-1-1}

\begin{itemize}
\item 信号: 随时间和空间变化的某种物理量.
\begin{itemize}
\item 信号通常是时间变量 $t$ 的函数
\item 信号的特性可从两方面来描述
\begin{itemize}
\item 时域特性
\item 频域特性
\end{itemize}
\end{itemize}
\item 系统: 能够对信号完成某种变换或运算功能的集合体称为系统
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{闭环系统组成}
\label{sec-1-2}


\begin{tikzpicture}[node distance=2em,auto,>=latex', thick ]
\tikzstyle{every node}=[font=\small]
%\path[use as bounding box] (-1,0) rectangle (10,-2); 
\path[->] node[text width =1em] (r) {给定}; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$ $,right =of r] (p1) { }; 
\path[->](r) edge node {} (p1) ; 
\path[blue] node[text width=1em,draw, right =of p1] (n) {串联校正}; 
\path[->] (p1) edge node[midway] {} (n) ; 
\path[->] node[ circle,inner sep=2pt,minimum size=1pt,draw,label=below left:$ $,right =of n] (p2) { }; 
\path[->](n) edge node {} (p2) ; 
\path[red] node[draw, inner sep=5pt,right =of p2] (a) {放大}; 
\path[->] (p2) edge node[midway] {} (a) ; 
\path[red] node[draw, inner sep=5pt,right =of a] (e) {执行}; 
\path[->] (a) edge node[midway] {} (e) ; 
\path[red] node[draw, text width=1em,inner sep=5pt,right =of e] (g) {被控对象}; 
\path[->] (e) edge node [midway]{$ $} (g); 
\path[->] node[ right =of g,text width=1em] (o) {输出}; 
\path[->] (g) edge node {} (o); 

\path[blue] node[draw, below =of a] (l) {局部反馈};
\path[->,draw] (e.east)+(1em,0) |- (l.east) ; 
\path[->,draw] (l.west) -| node[very near end] {$-$}(p2) ; 

\path[blue] node[draw, below =of l] (h) {主反馈};
\path[->,draw] (g.east)+(1em,0) |- (h.east) ; 
\path[->,draw] (h.west) -| node[very near end] {$-$}(p1) ; 
\end{tikzpicture} 
\end{frame}
\begin{frame}
\frametitle{闭环系统中的信号}
\label{sec-1-3}

\begin{itemize}
\item <2->输入信号：给定信号及干扰信号
\item <2->输出信号：被控量的物理量
\item <3->反馈信号：反馈元部件的输出
\end{itemize}
\begin{itemize}
\item <4->误差信号：输出量的希望值与实际值之差
\item <5->干扰信号：系统受到的内外干扰
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{典型信号}
\label{sec-1-4}

\begin{itemize}
\item <2->阶跃信号（函数）  $r(t)=\begin{cases} A & t\geq 0 \\ 0 & t < 0 \end{cases}$
\item <3->脉冲信号（函数）  $r(t)=\begin{cases}\frac{A}{\epsilon}  & 0\leq t\leq \epsilon\\ 0 & others\end{cases}$
\item <4->正弦信号（函数）  $r(t)=A\sin(\omega t), t>0$
\item <5->斜坡信号（函数）  $r(t)=Vt  ,     t>0$
\item <6->加速度信号（函数）$r(t)=\frac{1}{2}at^2,  t>0$
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{按给定量的运动规律分类}
\label{sec-1-5}

\begin{enumerate}
\item <2->镇定系统：输入 $r(t)$ 不变
\item <3->程序控制系统：输入 $r(t)$ 按规律变化
\item <4->随动系统:输入 $r(t)$ 随机变化
\end{enumerate}
\end{frame}
\begin{frame}
\frametitle{按系统性能分类}
\label{sec-1-6}

\begin{enumerate}
\item <2->线性系统和非线性系统
\begin{itemize}
\item 线性系统: 系统的输入和输出因果关系可以用线性微分方程描述
\item 非线性系统: $r(t)$ 和 $c(t)$ 关系只能用非线性方程描述
\end{itemize}
\item <3->定常系统与时变系统
\begin{itemize}
\item 定常系统：微分方程中各项系数为常数 $a_0c''(t)+a_1c'(t)=r(t)$
\item 时变系统：各项系数中有随时间变化的量 $a_0(t)c''(t)+a_1(t)c'(t)=r(t)$
\end{itemize}
\item <4->连续系统与离散系统
\begin{itemize}
\item 连续系统：系统中信号是时间t的连续函数的模拟量
\item 离散系统：系统中存在脉冲量或数字信号
\end{itemize}
\item <5->确定性和不确定性系统
    确定性系统：系统中微分方程参数变化是精确可知的
    不确定性系统：参数变化只是部分可知或近似可知
\end{enumerate}
\end{frame}
\section{控制系统基本要求}
\label{sec-2}
\begin{frame}
\frametitle{基本要求：稳定性、稳态性能、瞬态性能}
\label{sec-2-1}

\begin{enumerate}
\item <2->稳定性: 正常工作的先决条件
\item <3->稳态性能: 指标：稳态误差
\item <4->瞬态性能:
\begin{enumerate}
\item <5->峰值时间：$t_p$
\item <6->调节时间：$t_s$
\item <7->超调量：$\sigma \% = \frac{c(t_p)-c(\infty)}{c(\infty)}$
\end{enumerate}
\end{enumerate}
\end{frame}
\begin{frame}
\frametitle{示例:响应曲线}
\label{sec-2-2}
\begin{columns}
\begin{column}{0.7\textwidth}
\begin{block}{初始值:0，期望值1：}
\label{sec-2-2-1}



\begin{tikzpicture}[scale=2]
\coordinate (o) at (0,0);
\coordinate (ox) at (3,0);
\coordinate (oy) at (0,1.5);
\draw[->] (o) -- (ox);
\draw[->] (o) -- (oy);
\draw (o) node[below] {$o$};
\draw [red,thick,smooth] plot coordinates {(0,0) (1,1) (1.5,1.2) (2,1.05) (2.5,0.95) (3,1)};
\draw[thick,blue,dashed] (0,1) -- (3,1);
\draw[thick,violet,dashed] (0,0.95) -- (3,0.95);
\draw[thick,violet,dashed] (0,1.05) -- (3,1.05);
\draw[thick,red,dashed] (1.5,1.2) -- (1.5,0);\draw (1.5,0) node[below] {$t_p$};
\draw[thick,red,dashed] (2,1.05) -- (2,0);\draw (2,0) node[below] {$t_s$};
\draw (o) node[left] {$0$}
;\draw (0,1) node[left] {$1$};
\end{tikzpicture}
\end{block}
\end{column}
\begin{column}{0.3\textwidth}
\begin{block}{指标：}
\label{sec-2-2-2}


\begin{itemize}
\item <2->超调量 $\sigma\%$
\item <3->调节时间 $t_s$
\item <4->上升时间 $t_r$
\end{itemize}
\begin{itemize}
\item <5->峰值时间 $t_p$
\end{itemize}
\end{block}
\end{column}
\end{columns}
\end{frame}
\begin{frame}
\frametitle{指标}
\label{sec-2-3}

\begin{itemize}
\item 超调量：  $(c(t_p)-c(\infty))/c(\infty)$
\item 调节时间： 若有 $t_s$ ,当 $t\geq t_s$ 时有 $|c(t)-c(\infty)|\leq 0.05c(\infty)$ （或 $0.03c(\infty)$ ）成立，则 $t_s$ 为该系统调节时间。
\item 上升时间 $t_r$ ，定义
\begin{itemize}
\item $100\%$ 的 $t_r，c(t)$ 首次达到 $c(\infty)$ 的时间
\item $90\%$ 的 $t_r，c(t)$ 首次达到 $90\%c(\infty)$ 的时间
\item $70\%$ 的 $t_r，c(t)$ 首次达到 $70\%c(\infty)$ 的时间
\end{itemize}
\item 峰值时间 $t_p$ ： $c(t_p)=Max(c(t))$
\end{itemize}
\end{frame}

\end{document}
